const stateList = [
    {
        label: "آذربايجان شرقي",
        value: 1
    },
    {
        label: "آذربايجان غربي",
        value: 2
    },
    {
        label: "اردبيل",
        value: 3
    },
    {
        label: "اصفهان",
        value: 4
    },
    {
        label: "ايلام",
        value: 5
    },
    {
        label: "بوشهر",
        value: 6
    },
    {
        label: "تهران",
        value: 7
    },
    {
        label: "چهارمحال بختياري",
        value: 8
    },
    {
        label: "خراسان جنوبي",
        value: 9
    },
    {
        label: "خراسان رضوي",
        value: 10
    },
    {
        label: "خراسان شمالي",
        value: 11
    },
    {
        label: "خوزستان",
        value: 12
    },
    {
        label: "زنجان",
        value: 13
    },
    {
        label: "سمنان",
        value: 14
    },
    {
        label: "سيستان و بلوچستان",
        value: 15
    },
    {
        label: "فارس",
        value: 16
    },
    {
        label: "قزوين",
        value: 17
    },
    {
        label: "قم",
        value: 18
    },
    {
        label: "کرج",
        value: 19
    },
    {
        label: "كردستان",
        value: 20
    },
    {
        label: "كرمان",
        value: 21
    },
    {
        label: "كرمانشاه",
        value: 22
    },
    {
        label: "كهكيلويه و بويراحمد",
        value: 23
    },
    {
        label: "گلستان",
        value: 24
    },
    {
        label: "گيلان",
        value: 25
    },
    {
        label: "لرستان",
        value: 26
    },
    {
        label: "مازندران",
        value: 27
    },
    {
        label: "مركزي",
        value: 28
    },
    {
        label: "هرمزگان",
        value: 29
    },
    {
        label: "همدان",
        value: 30
    },
    {
        label: "يزد",
        value: 31
    },
]
let cityList = {
    1: ["اسكو", "اهر", "ایلخچی", "باسمنج", "بستان آباد", "بناب", "تبريز", "تسوج", "جلفا", "خسروشهر", "سراب", "سهند", "شبستر", "صوفیان", "مراغه", "مرند", "ملكان", "ممقان", "ميانه", "هاديشهر", "هريس", "هشترود", "ورزقان"],
    2: ["اروميه", "اشنويه", "بوكان", "تكاب", "خوي", "سر دشت", "سلماس", "شاهين دژ", "ماكو", "مهاباد", "مياندوآب", "نقده", "پلدشت", "پيرانشهر", "چالدران"],
    3: ["اردبيل", "خلخال", "مشگين شهر", "نمين", "نير", "پارس آباد", "گرمي"],
    4: ["آران و بيدگل", "اردستان", "اصفهان", "باغ بهادران", "تودشک", "تيران", "حاجي آباد", "خميني شهر", "خوانسار", "درچه", "دهاقان", "زرين شهر", "سميرم", "شهرضا", "عسگران", "علويجه", "فلاورجان", "كاشان", "مباركه", "نجف آباد", "نطنز", "ورزنه", "کوهپایه", "گلپايگان"],
    5: ["آبدانان", "ايلام", "ايوان", "دره شهر", "دهلران", "سرابله", "مهران"],
    6: ["اهرم", "برازجان", "بوشهر", "جم", "خورموج", "دير", "عسلویه", "كنگان", "کاکی", "گناوه"],
    7: ["اسلامشهر", "باقرشهر", "بومهن", "تجريش", "تهران", "دماوند", "رباط كريم", "رودهن", "ري", "شريف آباد", "شهريار", "فشم", "فيروزكوه", "قدس", "قرچك", "كهريزك", "لواسان", "ملارد", "ورامين", "پاكدشت", "چهاردانگه"],
    8: ["اردل", "بروجن", "شهركرد", "فارسان", "لردگان", "چلگرد"],
    9: ["بيرجند", "سربيشه", "فردوس", "قائن", "نهبندان"],
    10: ["تايباد", "تربت جام", "تربت حيدريه", "خواف", "درگز", "سبزوار", "سرخس", "طبس", "طرقبه", "فريمان", "قوچان", "كاشمر", "مشهد", "نيشابور", "چناران", "گناباد"],
    11: ["آشخانه", "اسفراين", "بجنورد", "جاجرم", "شيروان"],
    12: ["آبادان", "انديمشك", "اهواز", "ايذه", "ايرانشهر", "باغ ملك", "بندر امام خميني", "بندر ماهشهر", "بهبهان", "حمیدیه", "خرمشهر", "دزفول", "رامشیر", "رامهرمز", "سوسنگرد", "شادگان", "شادگان", "شوش", "شوشتر", "لالي", "مسجد سليمان", "ملاثانی", "هنديجان", "هويزه"],
    13: ["آب بر", "ابهر", "خدابنده", "خرمدره", "زنجان", "قيدار", "ماهنشان"],
    14: ["ايوانكي", "بسطام", "دامغان", "سمنان", "شاهرود", "گرمسار"],
    15: ["ايرانشهر", "خاش", "زابل", "زاهدان", "سراوان", "سرباز", "ميرجاوه", "چابهار"],
    16: ["آباده", "اردكان", "ارسنجان", "استهبان", "اقليد", "بوانات", "جهرم", "حاجي آباد", "خرامه", "خنج", "داراب", "زرقان", "سروستان", "سوريان", "سپيدان", "شيراز", "صفاشهر", "فراشبند", "فسا", "فيروز آباد", "كازرون", "لار", "لامرد", "مرودشت", "مهر", "کوار"],
    17: ["آبيك", "بوئين زهرا", "تاكستان", "قزوين"],
    18: ["قم"],
    19: ["اشتهارد", "طالقان", "كرج", "ماهدشت", "نظرآباد", "هشتگرد"],
    20: ["بانه", "بيجار", "حسن آباد", "سقز", "سنندج", "صلوات آباد", "قروه", "مريوان"],
    21: ["انار", "بافت", "بردسير", "بم", "جيرفت", "راور", "رفسنجان", "زرند", "سيرجان", "كرمان", "كهنوج", "کوهبنان"],
    22: ["اسلام آباد غرب", "جوانرود", "سنقر", "صحنه", "قصر شيرين", "كرمانشاه", "كنگاور", "هرسين", "پاوه"],
    23: ["دهدشت", "دوگنبدان", "سي سخت", "ياسوج", "گچساران"],
    24: ["آزاد شهر", "آق قلا", "راميان", "علي آباد كتول", "كردكوی", "كلاله", "گرگان", "گنبد كاووس"],
    25: ["آستارا", "املش", "تالش", "رشت", "رودبار", "شفت", "صومعه سرا", "فومن", "لاهیجان", "لنگرود", "ماسال", "ماسوله", "منجيل", "هشتپر"],
    26: ["ازنا", "الشتر", "اليگودرز", "بروجرد", "خرم آباد", "دزفول", "دورود", "كوهدشت", "ماهشهر", "نور آباد"],
    27: ["آمل", "بابل", "بابلسر", "بلده", "بهشهر", "تنكابن", "جويبار", "رامسر", "ساري", "قائم شهر", "محمود آباد", "نكا", "نور", "نوشهر", "چالوس"],
    28: ["آشتيان", "اراك", "تفرش", "خمين", "دليجان", "ساوه", "شازند", "محلات"],
    29: ["بستك", "بندر جاسك", "بندر خمیر", "بندر لنگه", "بندرعباس", "حاجي آباد", "دهبارز", "قشم", "قشم", "كيش", "ميناب"],
    30: ["اسدآباد", "بهار", "رزن", "ملاير", "نهاوند", "همدان"],
    31: ["ابركوه", "اردكان", "اشكذر", "بافق", "تفت", "خضرآباد", "زارچ", "طبس", "مهريز", "ميبد", "هرات", "يزد"]
};